pyocd/pyOCD/pyocd/debug/svd/data/HC32F334.svd
                <register>
                    <name>TMR0_TRGSEL</name>
                    <description>desc TMR0_TRGSEL</description>
                    <addressOffset>0x54</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00001FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMRA_TRGSEL0</name>
                    <description>desc TMRA_TRGSEL0</description>
                    <addressOffset>0x58</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00001FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMRA_TRGSEL1</name>
                    <description>desc TMRA_TRGSEL1</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00001FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMRA_TRGSEL2</name>
                    <description>desc TMRA_TRGSEL2</description>
                    <addressOffset>0x60</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00001FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMRA_TRGSEL3</name>
                    <description>desc TMRA_TRGSEL3</description>
                    <addressOffset>0x64</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00001FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC1_TRGSEL0</name>
                    <description>desc ADC1_TRGSEL0</description>
                    <addressOffset>0x68</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00001FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC1_TRGSEL1</name>
                    <description>desc ADC1_TRGSEL1</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00001FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC2_TRGSEL0</name>
                    <description>desc ADC2_TRGSEL0</description>
                    <addressOffset>0x70</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00001FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC2_TRGSEL1</name>
                    <description>desc ADC2_TRGSEL1</description>
                    <addressOffset>0x74</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00001FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC3_TRGSEL0</name>
                    <description>desc ADC3_TRGSEL0</description>
                    <addressOffset>0x78</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00001FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC3_TRGSEL1</name>
                    <description>desc ADC3_TRGSEL1</description>
                    <addressOffset>0x7C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00001FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMTRGSEL1</name>
                    <description>desc COMTRGSEL1</description>
                    <addressOffset>0x80</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COMTRGSEL2</name>
                    <description>desc COMTRGSEL2</description>
                    <addressOffset>0x84</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0x1FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEVNTDIRR1</name>
                    <description>desc PEVNTDIRR1</description>
                    <addressOffset>0x100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PDIR</name>
                            <description>desc PDIR</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEVNTIDR1</name>
                    <description>desc PEVNTIDR1</description>
                    <addressOffset>0x104</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PIN</name>
                            <description>desc PIN</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEVNTODR1</name>
                    <description>desc PEVNTODR1</description>
                    <addressOffset>0x108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>POUT</name>
                            <description>desc POUT</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEVNTORR1</name>
                    <description>desc PEVNTORR1</description>
                    <addressOffset>0x10C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>POR</name>
                            <description>desc POR</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEVNTOSR1</name>
                    <description>desc PEVNTOSR1</description>
                    <addressOffset>0x110</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>POS</name>
                            <description>desc POS</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEVNTRISR1</name>
                    <description>desc PEVNTRISR1</description>
                    <addressOffset>0x114</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RIS</name>
                            <description>desc RIS</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEVNTFALR1</name>
                    <description>desc PEVNTFALR1</description>
                    <addressOffset>0x118</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FAL</name>
                            <description>desc FAL</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEVNTDIRR2</name>
                    <description>desc PEVNTDIRR2</description>
                    <addressOffset>0x11C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PDIR</name>
                            <description>desc PDIR</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEVNTIDR2</name>
                    <description>desc PEVNTIDR2</description>
                    <addressOffset>0x120</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PIN</name>
                            <description>desc PIN</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEVNTODR2</name>
                    <description>desc PEVNTODR2</description>
                    <addressOffset>0x124</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>POUT</name>
                            <description>desc POUT</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEVNTORR2</name>
                    <description>desc PEVNTORR2</description>
                    <addressOffset>0x128</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>POR</name>
                            <description>desc POR</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEVNTOSR2</name>
                    <description>desc PEVNTOSR2</description>
                    <addressOffset>0x12C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>POS</name>
                            <description>desc POS</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEVNTRISR2</name>
                    <description>desc PEVNTRISR2</description>
                    <addressOffset>0x130</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RIS</name>
                            <description>desc RIS</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
