pyocd/pyOCD/pyocd/debug/svd/data/HC32F334.svd
                <register>
                    <name>EEFLTCR2</name>
                    <description>desc EEFLTCR2</description>
                    <addressOffset>0x234</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EE6LAT</name>
                            <description>desc EE6LAT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE6FM</name>
                            <description>desc EE6FM</description>
                            <msb>4</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE6TMO</name>
                            <description>desc EE6TMO</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE7LAT</name>
                            <description>desc EE7LAT</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE7FM</name>
                            <description>desc EE7FM</description>
                            <msb>10</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE7TMO</name>
                            <description>desc EE7TMO</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE8LAT</name>
                            <description>desc EE8LAT</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE8FM</name>
                            <description>desc EE8FM</description>
                            <msb>16</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE8TMO</name>
                            <description>desc EE8TMO</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE9LAT</name>
                            <description>desc EE9LAT</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE9FM</name>
                            <description>desc EE9FM</description>
                            <msb>22</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE9TMO</name>
                            <description>desc EE9TMO</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE10LAT</name>
                            <description>desc EE10LAT</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE10FM</name>
                            <description>desc EE10FM</description>
                            <msb>28</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EE10TMO</name>
                            <description>desc EE10TMO</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCNAR3</name>
                    <description>desc PCNAR3</description>
                    <addressOffset>0x238</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xAAAAA</resetValue>
                    <resetMask>0xFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EXEV1DCA</name>
                            <description>desc EXEV1DCA</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV2DCA</name>
                            <description>desc EXEV2DCA</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV3DCA</name>
                            <description>desc EXEV3DCA</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV4DCA</name>
                            <description>desc EXEV4DCA</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV5DCA</name>
                            <description>desc EXEV5DCA</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV6DCA</name>
                            <description>desc EXEV6DCA</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV7DCA</name>
                            <description>desc EXEV7DCA</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV8DCA</name>
                            <description>desc EXEV8DCA</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV9DCA</name>
                            <description>desc EXEV9DCA</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV10DCA</name>
                            <description>desc EXEV10DCA</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMEDCA</name>
                            <description>desc CMEDCA</description>
                            <msb>21</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMFDCA</name>
                            <description>desc CMFDCA</description>
                            <msb>23</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCMADCA</name>
                            <description>desc SCMADCA</description>
                            <msb>25</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCMBDCA</name>
                            <description>desc SCMBDCA</description>
                            <msb>27</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCNBR3</name>
                    <description>desc PCNBR3</description>
                    <addressOffset>0x23C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xAAAAA</resetValue>
                    <resetMask>0xFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EXEV1DCB</name>
                            <description>desc EXEV1DCB</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV2DCB</name>
                            <description>desc EXEV2DCB</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV3DCB</name>
                            <description>desc EXEV3DCB</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV4DCB</name>
                            <description>desc EXEV4DCB</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV5DCB</name>
                            <description>desc EXEV5DCB</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV6DCB</name>
                            <description>desc EXEV6DCB</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV7DCB</name>
                            <description>desc EXEV7DCB</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV8DCB</name>
                            <description>desc EXEV8DCB</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV9DCB</name>
                            <description>desc EXEV9DCB</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXEV10DCB</name>
                            <description>desc EXEV10DCB</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMEDCB</name>
                            <description>desc CMEDCB</description>
                            <msb>21</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMFDCB</name>
                            <description>desc CMFDCB</description>
                            <msb>23</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCMADCB</name>
                            <description>desc SCMADCB</description>
                            <msb>25</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCMBDCB</name>
                            <description>desc SCMBDCB</description>
                            <msb>27</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IDLECR</name>
                    <description>desc IDLECR</description>
                    <addressOffset>0x240</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x30F1F0F</resetMask>
                    <fields>
                        <field>
                            <name>IDLEBMA</name>
                            <description>desc IDLEBMA</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IDLESA</name>
                            <description>desc IDLESA</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DIDLA</name>
                            <description>desc DIDLA</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DLYCHA</name>
                            <description>desc DLYCHA</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DLYPRTEN</name>
                            <description>desc DLYPRTEN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DLYEVSEL</name>
                            <description>desc DLYEVSEL</description>
                            <msb>11</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DLYSTRG</name>
                            <description>desc DLYSTRG</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IDLEBMB</name>
                            <description>desc IDLEBMB</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IDLESB</name>
                            <description>desc IDLESB</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DIDLB</name>
                            <description>desc DIDLB</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DLYCHB</name>
                            <description>desc DLYCHB</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTENDLYPRT</name>
                            <description>desc INTENDLYPRT</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FOLLOW</name>
                            <description>desc FOLLOW</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
