pyocd/pyOCD/pyocd/debug/svd/data/HC32F334.svd
                <register>
                    <name>SCMASELR</name>
                    <description>desc SCMASELR</description>
                    <addressOffset>0x268</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1FFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CMSA1</name>
                            <description>desc CMSA1</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMSB1</name>
                            <description>desc CMSB1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVF1</name>
                            <description>desc OVF1</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UDF1</name>
                            <description>desc UDF1</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMSA2</name>
                            <description>desc CMSA2</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMSB2</name>
                            <description>desc CMSB2</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVF2</name>
                            <description>desc OVF2</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UDF2</name>
                            <description>desc UDF2</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMSA3</name>
                            <description>desc CMSA3</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMSB3</name>
                            <description>desc CMSB3</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVF3</name>
                            <description>desc OVF3</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UDF3</name>
                            <description>desc UDF3</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMSA4</name>
                            <description>desc CMSA4</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMSB4</name>
                            <description>desc CMSB4</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVF4</name>
                            <description>desc OVF4</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UDF4</name>
                            <description>desc UDF4</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMSA5</name>
                            <description>desc CMSA5</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMSB5</name>
                            <description>desc CMSB5</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVF5</name>
                            <description>desc OVF5</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UDF5</name>
                            <description>desc UDF5</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMSA6</name>
                            <description>desc CMSA6</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMSB6</name>
                            <description>desc CMSB6</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVF6</name>
                            <description>desc OVF6</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UDF6</name>
                            <description>desc UDF6</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EEVDET</name>
                            <description>desc EEVDET</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR</name>
                    <description>desc CR</description>
                    <addressOffset>0x2A0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7338</resetMask>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>desc EN</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DACSYNC1</name>
                            <description>desc DACSYNC1</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DACSYNC2</name>
                            <description>desc DACSYNC2</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DACSRC</name>
                            <description>desc DACSRC</description>
                            <msb>14</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PHSCTL</name>
                    <description>desc PHSCTL</description>
                    <addressOffset>0x2A4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x700</resetMask>
                    <fields>
                        <field>
                            <name>BENPHS</name>
                            <description>desc BENPHS</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BTRUPHS</name>
                            <description>desc BTRUPHS</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BTRDPHS</name>
                            <description>desc BTRDPHS</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PHSCMP1A</name>
                    <description>desc PHSCMP1A</description>
                    <addressOffset>0x2B4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7FFFC0</resetValue>
                    <resetMask>0x7FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PHSCMP1A</name>
                            <description>desc PHSCMP1A</description>
                            <msb>22</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PHSCMP1B</name>
                    <description>desc PHSCMP1B</description>
                    <addressOffset>0x2B8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7FFFC0</resetValue>
                    <resetMask>0x7FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PHSCMP1B</name>
                            <description>desc PHSCMP1B</description>
                            <msb>22</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PHSCMP2A</name>
                    <description>desc PHSCMP2A</description>
                    <addressOffset>0x2BC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7FFFC0</resetValue>
                    <resetMask>0x7FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PHSCMP2A</name>
                            <description>desc PHSCMP2A</description>
                            <msb>22</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PHSCMP2B</name>
                    <description>desc PHSCMP2B</description>
                    <addressOffset>0x2C0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7FFFC0</resetValue>
                    <resetMask>0x7FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PHSCMP2B</name>
                            <description>desc PHSCMP2B</description>
                            <msb>22</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PHSCMP3A</name>
                    <description>desc PHSCMP3A</description>
                    <addressOffset>0x2C4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7FFFC0</resetValue>
                    <resetMask>0x7FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PHSCMP3A</name>
                            <description>desc PHSCMP3A</description>
                            <msb>22</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PHSCMP3B</name>
                    <description>desc PHSCMP3B</description>
                    <addressOffset>0x2C8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7FFFC0</resetValue>
                    <resetMask>0x7FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PHSCMP3B</name>
                            <description>desc PHSCMP3B</description>
                            <msb>22</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PHSCMP4A</name>
                    <description>desc PHSCMP4A</description>
                    <addressOffset>0x2CC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7FFFC0</resetValue>
                    <resetMask>0x7FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PHSCMP4A</name>
                            <description>desc PHSCMP4A</description>
                            <msb>22</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PHSCMP4B</name>
                    <description>desc PHSCMP4B</description>
                    <addressOffset>0x2D0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7FFFC0</resetValue>
                    <resetMask>0x7FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PHSCMP4B</name>
                            <description>desc PHSCMP4B</description>
                            <msb>22</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PHSCMP5A</name>
                    <description>desc PHSCMP5A</description>
                    <addressOffset>0x2D4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7FFFC0</resetValue>
                    <resetMask>0x7FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PHSCMP5A</name>
                            <description>desc PHSCMP5A</description>
                            <msb>22</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PHSCMP5B</name>
                    <description>desc PHSCMP5B</description>
                    <addressOffset>0x2D8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x7FFFC0</resetValue>
                    <resetMask>0x7FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PHSCMP5B</name>
                            <description>desc PHSCMP5B</description>
                            <msb>22</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
