pyocd/pyOCD/pyocd/debug/svd/data/HC32F334.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>HRPWM2</name>
            <description>desc HRPWM</description>
            <baseAddress>0x4003C400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2A8</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>HRPWM2_GCMP</name>
                <description>HRPWM unit 2 compare matched interrupt</description>
                <value>78</value>
            </interrupt>
            <interrupt>
                <name>HRPWM2_OVF_UDF</name>
                <description>HRPWM unit 2 overflow or underflow interrupt</description>
                <value>79</value>
            </interrupt>
            <interrupt>
                <name>HRPWM2_SCM</name>
                <description>HRPWM unit 2 spacail compare interrupt</description>
                <value>80</value>
            </interrupt>
            <interrupt>
                <name>HRPWM2_GCAP</name>
                <description>HRPWM unit 2 capture interrupt</description>
                <value>81</value>
            </interrupt>
            <registers>
                <register>
                    <name>CNTER</name>
                    <description>desc CNTER</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>desc CNT</description>
                            <msb>21</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UPDAR</name>
                    <description>desc UPDAR</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>UPDA</name>
                            <description>desc UPDA</description>
                            <msb>21</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HRPERAR</name>
                    <description>desc HRPERAR</description>
                    <addressOffset>0x40</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3FFFC0</resetValue>
                    <resetMask>0x3FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HRPERA</name>
                            <description>desc HRPERA</description>
                            <msb>21</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HRPERBR</name>
                    <description>desc HRPERBR</description>
                    <addressOffset>0x44</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3FFFC0</resetValue>
                    <resetMask>0x3FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HRPERB</name>
                            <description>desc HRPERB</description>
                            <msb>21</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HRGCMAR</name>
                    <description>desc HRGCMAR</description>
                    <addressOffset>0x80</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3FFFC0</resetValue>
                    <resetMask>0x3FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HRGCMA</name>
                            <description>desc HRGCMA</description>
                            <msb>21</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HRGCMBR</name>
                    <description>desc HRGCMBR</description>
                    <addressOffset>0x84</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3FFFC0</resetValue>
                    <resetMask>0x3FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HRGCMB</name>
                            <description>desc HRGCMB</description>
                            <msb>21</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HRGCMCR</name>
                    <description>desc HRGCMCR</description>
                    <addressOffset>0x88</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3FFFC0</resetValue>
                    <resetMask>0x3FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HRGCMC</name>
                            <description>desc HRGCMC</description>
                            <msb>21</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HRGCMDR</name>
                    <description>desc HRGCMDR</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3FFFC0</resetValue>
                    <resetMask>0x3FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HRGCMD</name>
                            <description>desc HRGCMD</description>
                            <msb>21</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HRGCMER</name>
                    <description>desc HRGCMER</description>
                    <addressOffset>0x90</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3FFFC0</resetValue>
                    <resetMask>0x3FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HRGCME</name>
                            <description>desc HRGCME</description>
                            <msb>21</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HRGCMFR</name>
                    <description>desc HRGCMFR</description>
                    <addressOffset>0x94</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3FFFC0</resetValue>
                    <resetMask>0x3FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HRGCMF</name>
                            <description>desc HRGCMF</description>
                            <msb>21</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HRGCMGR</name>
                    <description>desc HRGCMGR</description>
                    <addressOffset>0x98</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3FFFC0</resetValue>
                    <resetMask>0x3FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HRGCMG</name>
                            <description>desc HRGCMG</description>
                            <msb>21</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HRGCMHR</name>
                    <description>desc HRGCMHR</description>
                    <addressOffset>0x9C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3FFFC0</resetValue>
                    <resetMask>0x3FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HRGCMH</name>
                            <description>desc HRGCMH</description>
                            <msb>21</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCMAR</name>
                    <description>desc SCMAR</description>
                    <addressOffset>0xC0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3FFFC0</resetValue>
                    <resetMask>0x3FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SCMA</name>
                            <description>desc SCMA</description>
                            <msb>21</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCMBR</name>
                    <description>desc SCMBR</description>
                    <addressOffset>0xC4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3FFFC0</resetValue>
                    <resetMask>0x3FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SCMB</name>
                            <description>desc SCMB</description>
                            <msb>21</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCMCR</name>
                    <description>desc SCMCR</description>
                    <addressOffset>0xC8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3FFFC0</resetValue>
                    <resetMask>0x3FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SCMC</name>
                            <description>desc SCMC</description>
                            <msb>21</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCMDR</name>
                    <description>desc SCMDR</description>
                    <addressOffset>0xCC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3FFFC0</resetValue>
                    <resetMask>0x3FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SCMD</name>
                            <description>desc SCMD</description>
                            <msb>21</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAPAR</name>
                    <description>desc CAPAR</description>
                    <addressOffset>0xD0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3FFFC0</resetValue>
                    <resetMask>0x7FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CAPA</name>
                            <description>desc CAPA</description>
                            <msb>21</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAPDIRA</name>
                            <description>desc CAPDIRA</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAPBR</name>
                    <description>desc CAPBR</description>
                    <addressOffset>0xD4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3FFFC0</resetValue>
                    <resetMask>0x7FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CAPB</name>
                            <description>desc CAPB</description>
                            <msb>21</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAPDIRB</name>
                            <description>desc CAPDIRB</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HRDTUAR</name>
                    <description>desc HRDTUAR</description>
                    <addressOffset>0x100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3FFFC0</resetValue>
                    <resetMask>0x3FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HRDTUA</name>
                            <description>desc HRDTUA</description>
                            <msb>21</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HRDTDAR</name>
                    <description>desc HRDTDAR</description>
                    <addressOffset>0x104</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3FFFC0</resetValue>
                    <resetMask>0x3FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HRDTDA</name>
                            <description>desc HRDTDA</description>
                            <msb>21</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HRDTUBR</name>
                    <description>desc HRDTUBR</description>
                    <addressOffset>0x108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3FFFC0</resetValue>
                    <resetMask>0x3FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HRDTUB</name>
                            <description>desc HRDTUB</description>
                            <msb>21</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HRDTDBR</name>
                    <description>desc HRDTDBR</description>
                    <addressOffset>0x10C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x3FFFC0</resetValue>
                    <resetMask>0x3FFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HRDTDB</name>
                            <description>desc HRDTDB</description>
                            <msb>21</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GCONR</name>
                    <description>desc GCONR</description>
                    <addressOffset>0x140</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x105</resetMask>
                    <fields>
                        <field>
                            <name>START</name>
                            <description>desc START</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MODE</name>
                            <description>desc MODE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVSTP</name>
                            <description>desc OVSTP</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
