pyocd/pyOCD/pyocd/debug/svd/data/HC32F334.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="HRPWM2">
            <name>HRPWM3</name>
            <description>desc HRPWM</description>
            <baseAddress>0x4003C800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2A8</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>HRPWM3_GCMP</name>
                <description>HRPWM unit 3 compare matched interrupt</description>
                <value>87</value>
            </interrupt>
            <interrupt>
                <name>HRPWM3_OVF_UDF</name>
                <description>HRPWM unit 3 overflow or underflow interrupt</description>
                <value>88</value>
            </interrupt>
            <interrupt>
                <name>HRPWM3_SCM</name>
                <description>HRPWM unit 3 spacail compare interrupt</description>
                <value>89</value>
            </interrupt>
            <interrupt>
                <name>HRPWM3_GCAP</name>
                <description>HRPWM unit 3 capture interrupt</description>
                <value>90</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="HRPWM2">
            <name>HRPWM4</name>
            <description>desc HRPWM</description>
            <baseAddress>0x4003CC00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2A8</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>HRPWM4_GCMP</name>
                <description>HRPWM unit 4 compare matched interrupt</description>
                <value>91</value>
            </interrupt>
            <interrupt>
                <name>HRPWM4_OVF_UDF</name>
                <description>HRPWM unit 4 overflow or underflow interrupt</description>
                <value>92</value>
            </interrupt>
            <interrupt>
                <name>HRPWM4_SCM</name>
                <description>HRPWM unit 4 spacail compare interrupt</description>
                <value>93</value>
            </interrupt>
            <interrupt>
                <name>HRPWM4_GCAP</name>
                <description>HRPWM unit 4 capture interrupt</description>
                <value>94</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="HRPWM2">
            <name>HRPWM5</name>
            <description>desc HRPWM</description>
            <baseAddress>0x4003D000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2A8</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>HRPWM5_GCMP</name>
                <description>HRPWM unit 5 compare matched interrupt</description>
                <value>100</value>
            </interrupt>
            <interrupt>
                <name>HRPWM5_OVF_UDF</name>
                <description>HRPWM unit 5 overflow or underflow interrupt</description>
                <value>101</value>
            </interrupt>
            <interrupt>
                <name>HRPWM5_SCM</name>
                <description>HRPWM unit 5 spacail compare interrupt</description>
                <value>102</value>
            </interrupt>
            <interrupt>
                <name>HRPWM5_GCAP</name>
                <description>HRPWM unit 5 capture interrupt</description>
                <value>103</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="HRPWM2">
            <name>HRPWM6</name>
            <description>desc HRPWM</description>
            <baseAddress>0x4003D400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x2A8</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>HRPWM6_GCMP</name>
                <description>HRPWM unit 6 compare matched interrupt</description>
                <value>104</value>
            </interrupt>
            <interrupt>
                <name>HRPWM6_OVF_UDF</name>
                <description>HRPWM unit 6 overflow or underflow interrupt</description>
                <value>105</value>
            </interrupt>
            <interrupt>
                <name>HRPWM6_SCM</name>
                <description>HRPWM unit 6 spacail compare interrupt</description>
                <value>106</value>
            </interrupt>
            <interrupt>
                <name>HRPWM6_GCAP</name>
                <description>HRPWM unit 6 capture interrupt</description>
                <value>107</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>HRPWM_COMMON</name>
            <description>desc HRPWM_COMMON</description>
            <baseAddress>0x4003C2F0</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x110</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CALCR</name>
                    <description>desc CALCR</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x73F</resetMask>
                    <fields>
                        <field>
                            <name>CAL</name>
                            <description>desc CAL</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CALEN</name>
                            <description>desc CALEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CALPRD</name>
                            <description>desc CALPRD</description>
                            <msb>5</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CALENF</name>
                            <description>desc CALENF</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ERRF</name>
                            <description>desc ERRF</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CALIE</name>
                            <description>desc CALIE</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCAPR</name>
                    <description>desc SCAPR</description>
                    <addressOffset>0xAC</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>SCAP1A</name>
                            <description>desc SCAP1A</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SCAP1B</name>
                            <description>desc SCAP1B</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SCAP2A</name>
                            <description>desc SCAP2A</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SCAP2B</name>
                            <description>desc SCAP2B</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SCAP3A</name>
                            <description>desc SCAP3A</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SCAP3B</name>
                            <description>desc SCAP3B</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SCAP4A</name>
                            <description>desc SCAP4A</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SCAP4B</name>
                            <description>desc SCAP4B</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SCAP5A</name>
                            <description>desc SCAP5A</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SCAP5B</name>
                            <description>desc SCAP5B</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SCAP6A</name>
                            <description>desc SCAP6A</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SCAP6B</name>
                            <description>desc SCAP6B</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSTAIDLR</name>
                    <description>desc SSTAIDLR</description>
                    <addressOffset>0xB0</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>SSTAIDL1A</name>
                            <description>desc SSTAIDL1A</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTAIDL1B</name>
                            <description>desc SSTAIDL1B</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTAIDL2A</name>
                            <description>desc SSTAIDL2A</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTAIDL2B</name>
                            <description>desc SSTAIDL2B</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTAIDL3A</name>
                            <description>desc SSTAIDL3A</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTAIDL3B</name>
                            <description>desc SSTAIDL3B</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTAIDL4A</name>
                            <description>desc SSTAIDL4A</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTAIDL4B</name>
                            <description>desc SSTAIDL4B</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTAIDL5A</name>
                            <description>desc SSTAIDL5A</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTAIDL5B</name>
                            <description>desc SSTAIDL5B</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTAIDL6A</name>
                            <description>desc SSTAIDL6A</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>SSTAIDL6B</name>
                            <description>desc SSTAIDL6B</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSTARUNR1</name>
                    <description>desc SSTARUNR1</description>
                    <addressOffset>0xB4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>SSTARUN1A</name>
                            <description>desc SSTARUN1A</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTARUN1B</name>
                            <description>desc SSTARUN1B</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTARUN2A</name>
                            <description>desc SSTARUN2A</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTARUN2B</name>
                            <description>desc SSTARUN2B</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTARUN3A</name>
                            <description>desc SSTARUN3A</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTARUN3B</name>
                            <description>desc SSTARUN3B</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTARUN4A</name>
                            <description>desc SSTARUN4A</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTARUN4B</name>
                            <description>desc SSTARUN4B</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTARUN5A</name>
                            <description>desc SSTARUN5A</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTARUN5B</name>
                            <description>desc SSTARUN5B</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTARUN6A</name>
                            <description>desc SSTARUN6A</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTARUN6B</name>
                            <description>desc SSTARUN6B</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
