pyocd/pyOCD/pyocd/debug/svd/data/HC32F334.svd
                <register>
                    <name>EIRQCR3</name>
                    <description>desc EIRQCR3</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xB0B3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EISMPCLK</name>
                            <description>desc EISMPCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EFEN</name>
                            <description>desc EFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCSEL</name>
                            <description>desc NOCSEL</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCEN</name>
                            <description>desc NOCEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIRQCR4</name>
                    <description>desc EIRQCR4</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xB0B3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EISMPCLK</name>
                            <description>desc EISMPCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EFEN</name>
                            <description>desc EFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCSEL</name>
                            <description>desc NOCSEL</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCEN</name>
                            <description>desc NOCEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIRQCR5</name>
                    <description>desc EIRQCR5</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xB0B3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EISMPCLK</name>
                            <description>desc EISMPCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EFEN</name>
                            <description>desc EFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCSEL</name>
                            <description>desc NOCSEL</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCEN</name>
                            <description>desc NOCEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIRQCR6</name>
                    <description>desc EIRQCR6</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xB0B3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EISMPCLK</name>
                            <description>desc EISMPCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EFEN</name>
                            <description>desc EFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCSEL</name>
                            <description>desc NOCSEL</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCEN</name>
                            <description>desc NOCEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIRQCR7</name>
                    <description>desc EIRQCR7</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xB0B3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EISMPCLK</name>
                            <description>desc EISMPCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EFEN</name>
                            <description>desc EFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCSEL</name>
                            <description>desc NOCSEL</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCEN</name>
                            <description>desc NOCEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIRQCR8</name>
                    <description>desc EIRQCR8</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xB0B3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EISMPCLK</name>
                            <description>desc EISMPCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EFEN</name>
                            <description>desc EFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCSEL</name>
                            <description>desc NOCSEL</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCEN</name>
                            <description>desc NOCEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIRQCR9</name>
                    <description>desc EIRQCR9</description>
                    <addressOffset>0x34</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xB0B3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EISMPCLK</name>
                            <description>desc EISMPCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EFEN</name>
                            <description>desc EFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCSEL</name>
                            <description>desc NOCSEL</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCEN</name>
                            <description>desc NOCEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIRQCR10</name>
                    <description>desc EIRQCR10</description>
                    <addressOffset>0x38</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xB0B3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EISMPCLK</name>
                            <description>desc EISMPCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EFEN</name>
                            <description>desc EFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCSEL</name>
                            <description>desc NOCSEL</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCEN</name>
                            <description>desc NOCEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIRQCR11</name>
                    <description>desc EIRQCR11</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xB0B3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EISMPCLK</name>
                            <description>desc EISMPCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EFEN</name>
                            <description>desc EFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCSEL</name>
                            <description>desc NOCSEL</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCEN</name>
                            <description>desc NOCEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIRQCR12</name>
                    <description>desc EIRQCR12</description>
                    <addressOffset>0x40</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xB0B3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EISMPCLK</name>
                            <description>desc EISMPCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EFEN</name>
                            <description>desc EFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCSEL</name>
                            <description>desc NOCSEL</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCEN</name>
                            <description>desc NOCEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIRQCR13</name>
                    <description>desc EIRQCR13</description>
                    <addressOffset>0x44</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xB0B3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EISMPCLK</name>
                            <description>desc EISMPCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EFEN</name>
                            <description>desc EFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCSEL</name>
                            <description>desc NOCSEL</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCEN</name>
                            <description>desc NOCEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
