pyocd/pyOCD/pyocd/debug/svd/data/HC32F334.svd
                <register>
                    <name>MUXS6</name>
                    <description>desc MUXS6</description>
                    <addressOffset>0x58</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xC0FF</resetMask>
                    <fields>
                        <field>
                            <name>MUX1</name>
                            <description>desc MUX1</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUX0</name>
                            <description>desc MUX0</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUX1_4</name>
                            <description>desc MUX1_4</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUX0_4</name>
                            <description>desc MUX0_4</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LUTCTL6</name>
                    <description>desc LUTCTL6</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>LUTCTL</name>
                            <description>desc LUTCTL</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTL6</name>
                    <description>desc CTL6</description>
                    <addressOffset>0x60</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xC0</resetMask>
                    <fields>
                        <field>
                            <name>OEN</name>
                            <description>desc OEN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSEL</name>
                            <description>desc OSEL</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MUXS7</name>
                    <description>desc MUXS7</description>
                    <addressOffset>0x64</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xC0FF</resetMask>
                    <fields>
                        <field>
                            <name>MUX1</name>
                            <description>desc MUX1</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUX0</name>
                            <description>desc MUX0</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUX1_4</name>
                            <description>desc MUX1_4</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUX0_4</name>
                            <description>desc MUX0_4</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LUTCTL7</name>
                    <description>desc LUTCTL7</description>
                    <addressOffset>0x68</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>LUTCTL</name>
                            <description>desc LUTCTL</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTL7</name>
                    <description>desc CTL7</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xC0</resetMask>
                    <fields>
                        <field>
                            <name>OEN</name>
                            <description>desc OEN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSEL</name>
                            <description>desc OSEL</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MUXS8</name>
                    <description>desc MUXS8</description>
                    <addressOffset>0x70</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xC0FF</resetMask>
                    <fields>
                        <field>
                            <name>MUX1</name>
                            <description>desc MUX1</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUX0</name>
                            <description>desc MUX0</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUX1_4</name>
                            <description>desc MUX1_4</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUX0_4</name>
                            <description>desc MUX0_4</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LUTCTL8</name>
                    <description>desc LUTCTL8</description>
                    <addressOffset>0x74</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>LUTCTL</name>
                            <description>desc LUTCTL</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTL8</name>
                    <description>desc CTL8</description>
                    <addressOffset>0x78</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xC0</resetMask>
                    <fields>
                        <field>
                            <name>OEN</name>
                            <description>desc OEN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSEL</name>
                            <description>desc OSEL</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MUXS9</name>
                    <description>desc MUXS9</description>
                    <addressOffset>0x7C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xC0FF</resetMask>
                    <fields>
                        <field>
                            <name>MUX1</name>
                            <description>desc MUX1</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUX0</name>
                            <description>desc MUX0</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUX1_4</name>
                            <description>desc MUX1_4</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUX0_4</name>
                            <description>desc MUX0_4</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LUTCTL9</name>
                    <description>desc LUTCTL9</description>
                    <addressOffset>0x80</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>LUTCTL</name>
                            <description>desc LUTCTL</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTL9</name>
                    <description>desc CTL9</description>
                    <addressOffset>0x84</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xC0</resetMask>
                    <fields>
                        <field>
                            <name>OEN</name>
                            <description>desc OEN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSEL</name>
                            <description>desc OSEL</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MUXS10</name>
                    <description>desc MUXS10</description>
                    <addressOffset>0x88</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xC0FF</resetMask>
                    <fields>
                        <field>
                            <name>MUX1</name>
                            <description>desc MUX1</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUX0</name>
                            <description>desc MUX0</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUX1_4</name>
                            <description>desc MUX1_4</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUX0_4</name>
                            <description>desc MUX0_4</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LUTCTL10</name>
                    <description>desc LUTCTL10</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>LUTCTL</name>
                            <description>desc LUTCTL</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTL10</name>
                    <description>desc CTL10</description>
                    <addressOffset>0x90</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xC0</resetMask>
                    <fields>
                        <field>
                            <name>OEN</name>
                            <description>desc OEN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSEL</name>
                            <description>desc OSEL</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MUXS11</name>
                    <description>desc MUXS11</description>
                    <addressOffset>0x94</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xC0FF</resetMask>
                    <fields>
                        <field>
                            <name>MUX1</name>
                            <description>desc MUX1</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUX0</name>
                            <description>desc MUX0</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUX1_4</name>
                            <description>desc MUX1_4</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUX0_4</name>
                            <description>desc MUX0_4</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LUTCTL11</name>
                    <description>desc LUTCTL11</description>
                    <addressOffset>0x98</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>LUTCTL</name>
                            <description>desc LUTCTL</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTL11</name>
                    <description>desc CTL11</description>
                    <addressOffset>0x9C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xC0</resetMask>
                    <fields>
                        <field>
                            <name>OEN</name>
                            <description>desc OEN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSEL</name>
                            <description>desc OSEL</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MUXS12</name>
                    <description>desc MUXS12</description>
                    <addressOffset>0xA0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xC0FF</resetMask>
                    <fields>
                        <field>
                            <name>MUX1</name>
                            <description>desc MUX1</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUX0</name>
                            <description>desc MUX0</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUX1_4</name>
                            <description>desc MUX1_4</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MUX0_4</name>
                            <description>desc MUX0_4</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LUTCTL12</name>
                    <description>desc LUTCTL12</description>
                    <addressOffset>0xA4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>LUTCTL</name>
                            <description>desc LUTCTL</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
