pyocd/pyOCD/pyocd/debug/svd/data/HC32F334.svd
                <register>
                    <name>DCONR</name>
                    <description>desc DCONR</description>
                    <addressOffset>0x14C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF3</resetMask>
                    <fields>
                        <field>
                            <name>DTCEN</name>
                            <description>desc DTCEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEPA</name>
                            <description>desc SEPA</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTBENU</name>
                            <description>desc DTBENU</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTBEND</name>
                            <description>desc DTBEND</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTBTRU</name>
                            <description>desc DTBTRU</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTBTRD</name>
                            <description>desc DTBTRD</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCNAR</name>
                    <description>desc PCNAR</description>
                    <addressOffset>0x154</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x93F3FFFF</resetMask>
                    <fields>
                        <field>
                            <name>STACA</name>
                            <description>desc STACA</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STPCA</name>
                            <description>desc STPCA</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVFCA</name>
                            <description>desc OVFCA</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UDFCA</name>
                            <description>desc UDFCA</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMAUCA</name>
                            <description>desc CMAUCA</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMADCA</name>
                            <description>desc CMADCA</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMBUCA</name>
                            <description>desc CMBUCA</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMBDCA</name>
                            <description>desc CMBDCA</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FORCA</name>
                            <description>desc FORCA</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EMBCA</name>
                            <description>desc EMBCA</description>
                            <msb>21</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EMBRA</name>
                            <description>desc EMBRA</description>
                            <msb>23</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EMBSA</name>
                            <description>desc EMBSA</description>
                            <msb>25</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTENA</name>
                            <description>desc OUTENA</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAPMDA</name>
                            <description>desc CAPMDA</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PCNBR</name>
                    <description>desc PCNBR</description>
                    <addressOffset>0x158</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x93F3FFFF</resetMask>
                    <fields>
                        <field>
                            <name>STACB</name>
                            <description>desc STACB</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STPCB</name>
                            <description>desc STPCB</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVFCB</name>
                            <description>desc OVFCB</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UDFCB</name>
                            <description>desc UDFCB</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMAUCB</name>
                            <description>desc CMAUCB</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMADCB</name>
                            <description>desc CMADCB</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMBUCB</name>
                            <description>desc CMBUCB</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMBDCB</name>
                            <description>desc CMBDCB</description>
                            <msb>15</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FORCB</name>
                            <description>desc FORCB</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EMBCB</name>
                            <description>desc EMBCB</description>
                            <msb>21</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EMBRB</name>
                            <description>desc EMBRB</description>
                            <msb>23</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EMBSB</name>
                            <description>desc EMBSB</description>
                            <msb>25</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTENB</name>
                            <description>desc OUTENB</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CAPMDB</name>
                            <description>desc CAPMDB</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FCNGR</name>
                    <description>desc FCNGR</description>
                    <addressOffset>0x15C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x77</resetMask>
                    <fields>
                        <field>
                            <name>NOFIENGA</name>
                            <description>desc NOFIENGA</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFICKGA</name>
                            <description>desc NOFICKGA</description>
                            <msb>2</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFIENGB</name>
                            <description>desc NOFIENGB</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFICKGB</name>
                            <description>desc NOFICKGB</description>
                            <msb>6</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VPERR</name>
                    <description>desc VPERR</description>
                    <addressOffset>0x160</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F0300</resetMask>
                    <fields>
                        <field>
                            <name>SPPERIA</name>
                            <description>desc SPPERIA</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPPERIB</name>
                            <description>desc SPPERIB</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PCNTE</name>
                            <description>desc PCNTE</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PCNTS</name>
                            <description>desc PCNTS</description>
                            <msb>20</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STFLR</name>
                    <description>desc STFLR</description>
                    <addressOffset>0x164</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x80000000</resetValue>
                    <resetMask>0x8CE01FFF</resetMask>
                    <fields>
                        <field>
                            <name>CMAF</name>
                            <description>desc CMAF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMBF</name>
                            <description>desc CMBF</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMCF</name>
                            <description>desc CMCF</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMDF</name>
                            <description>desc CMDF</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMEF</name>
                            <description>desc CMEF</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMFF</name>
                            <description>desc CMFF</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVFF</name>
                            <description>desc OVFF</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UDFF</name>
                            <description>desc UDFF</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTEF</name>
                            <description>desc DTEF</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CMSAUF</name>
                            <description>desc CMSAUF</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMSADF</name>
                            <description>desc CMSADF</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMSBUF</name>
                            <description>desc CMSBUF</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMSBDF</name>
                            <description>desc CMSBDF</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VPERNUM</name>
                            <description>desc VPERNUM</description>
                            <msb>23</msb>
                            <lsb>21</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CMAF2</name>
                            <description>desc CMAF2</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMBF2</name>
                            <description>desc CMBF2</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DIRF</name>
                            <description>desc DIRF</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
