pyocd/pyOCD/pyocd/debug/svd/data/HC32F334.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="TMR61">
            <name>TMR62</name>
            <description>desc TMR6</description>
            <baseAddress>0x40039400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1A0</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TMR6_2_GCMP</name>
                <description>Timer 6 unit 2 compare matched interrupt</description>
                <value>56</value>
            </interrupt>
            <interrupt>
                <name>TMR6_2_OVF_UDF</name>
                <description>Timer 6 unit 2 overflow or underflow interrupt</description>
                <value>57</value>
            </interrupt>
            <interrupt>
                <name>TMR6_2_DTE</name>
                <description>Timer 6 unit 2 dead time error interrupt</description>
                <value>58</value>
            </interrupt>
            <interrupt>
                <name>TMR6_2_SCMP</name>
                <description>Timer 6 unit 2 special compare matched interrupt</description>
                <value>59</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="TMR61">
            <name>TMR63</name>
            <description>desc TMR6</description>
            <baseAddress>0x40039800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1A0</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TMR6_3_GCMP</name>
                <description>TMR6 unit 3 compare matched interrupt</description>
                <value>62</value>
            </interrupt>
            <interrupt>
                <name>TMR6_3_OVF_UDF</name>
                <description>TMR6 unit 3 overflow or underflow interrupt</description>
                <value>63</value>
            </interrupt>
            <interrupt>
                <name>TMR6_3_DTE</name>
                <description>TMR6 unit 3 dead time error interrupt</description>
                <value>64</value>
            </interrupt>
            <interrupt>
                <name>TMR6_3_SCMP</name>
                <description>TMR6 unit 3 special compare matched interrupt</description>
                <value>65</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="TMR61">
            <name>TMR64</name>
            <description>desc TMR6</description>
            <baseAddress>0x40039C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1A0</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TMR6_4_GCMP</name>
                <description>TMR6 unit 4 compare matched interrupt</description>
                <value>68</value>
            </interrupt>
            <interrupt>
                <name>TMR6_4_OVF_UDF</name>
                <description>TMR6 unit 4 overflow or underflow interrupt</description>
                <value>69</value>
            </interrupt>
            <interrupt>
                <name>TMR6_4_DTE</name>
                <description>TMR6 unit 4 dead time error interrupt</description>
                <value>70</value>
            </interrupt>
            <interrupt>
                <name>TMR6_4_SCMP</name>
                <description>TMR6 unit 4 special compare matched interrupt</description>
                <value>71</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>TMR6_COMMON</name>
            <description>desc TMR6_COMMON</description>
            <baseAddress>0x40039300</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x100</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>FCNTR</name>
                    <description>desc FCNTR</description>
                    <addressOffset>0xEC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7777</resetMask>
                    <fields>
                        <field>
                            <name>NOFIENTA</name>
                            <description>desc NOFIENTA</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFICKTA</name>
                            <description>desc NOFICKTA</description>
                            <msb>2</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFIENTB</name>
                            <description>desc NOFIENTB</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFICKTB</name>
                            <description>desc NOFICKTB</description>
                            <msb>6</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFIENTC</name>
                            <description>desc NOFIENTC</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFICKTC</name>
                            <description>desc NOFICKTC</description>
                            <msb>10</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFIENTD</name>
                            <description>desc NOFIENTD</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFICKTD</name>
                            <description>desc NOFICKTD</description>
                            <msb>14</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSTAR</name>
                    <description>desc SSTAR</description>
                    <addressOffset>0xF0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>SSTA1</name>
                            <description>desc SSTA1</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTA2</name>
                            <description>desc SSTA2</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTA3</name>
                            <description>desc SSTA3</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTA4</name>
                            <description>desc SSTA4</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSTPR</name>
                    <description>desc SSTPR</description>
                    <addressOffset>0xF4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>SSTP1</name>
                            <description>desc SSTP1</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTP2</name>
                            <description>desc SSTP2</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTP3</name>
                            <description>desc SSTP3</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SSTP4</name>
                            <description>desc SSTP4</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCLRR</name>
                    <description>desc SCLRR</description>
                    <addressOffset>0xF8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>SCLE1</name>
                            <description>desc SCLE1</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCLE2</name>
                            <description>desc SCLE2</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCLE3</name>
                            <description>desc SCLE3</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCLE4</name>
                            <description>desc SCLE4</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SUPDR</name>
                    <description>desc SUPDR</description>
                    <addressOffset>0xFC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF</resetMask>
                    <fields>
                        <field>
                            <name>SUPD1</name>
                            <description>desc SUPD1</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SUPD2</name>
                            <description>desc SUPD2</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SUPD3</name>
                            <description>desc SUPD3</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SUPD4</name>
                            <description>desc SUPD4</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
